app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
	def show
		@user = User.find(current_user)

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
---
	def edit
		@user = User.find(current_user.id)

SELECT * FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
UPDATE `users` SET `userpic_file_size` = 20932, `userpic_file_name` = '1192484103_2bbb2db04434a6b5577630a04b3c4f4c_full.jpg', `userpic_updated_at` = '2009-03-30 18:04:52', `updated_at` = '2009-03-30 18:04:52' WHERE `id` = 1
---
  def update
		@user = User.find(params[:id])

		if @user.update_attributes(params[:user])

INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `remember_token`, `login`, `email`, `created_at`) VALUES('', '35e6f154fec02168816a9772bd034458f943b89f', '2009-03-30 14:30:01', '6f7529d3785cd23ca02c01c9ea63abcebfc8424c', NULL, NULL, 'ognevsky', 'ognevsky@gmail.com', '2009-03-30 14:30:01')
---
  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save